---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDirn2
source: html/0fbf13ab-c029-d8b4-d744-abf7ae5f26d1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeTopDirn2 Property

"Top Minor Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeTopDirn2 { get; }
```